function randomJokeGenerator() {
    let randomJokes = [
        "استاد: 2 اور 2 کتنے ہوتے ہیں؟ طالب علم: چار۔ استاد: شاباش! اور 3 اور 3؟ طالب علم: میچ ڈرا۔",
        "بیوی: سنو، جب میں گاتی ہوں تو دل باغ باغ ہوجاتا ہے۔ شوہر: ہاں، اور جب تم چپ ہوتی ہو تو محلہ باغ باغ ہوجاتا ہے!",
        "پہلا دوست: یار، تم ہمیشہ اتنی دیر سے کیوں آتے ہو؟ دوسرا دوست: کیونکہ وقت سے پہلے آنے کا کوئی فائدہ نہیں ہوتا!",
        "استاد: اگر تمہیں کوئی آدمی جنگل میں اکیلا مل جائے تو کیا کرو گے؟ طالب علم: سیلفی لوں گا اور سوشل میڈیا پر ڈال دوں گا!",
        "بیوی: آج مجھے کچھ نیا سیکھاؤ۔ شوہر: چپ رہنا سیکھو۔",
        "پہلا دوست: تمہاری بیوی کا پسندیدہ کھانا کیا ہے؟ دوسرا دوست: دوسروں کے گھر کا کھانا!",
        "بچہ: امی، آج اسکول میں بہت مزہ آیا۔ امی: وہ کیسے؟ بچہ: آج اسکول بند تھا!",
        "شوہر: بیگم، مجھے لگا تھا کہ تمہارے بغیر میرا گزارا نہیں ہوگا۔ بیوی: اور اب؟ شوہر: اب یقین ہوگیا ہے کہ میرا خیال غلط تھا!",
        "استاد: دنیا کا سب سے بڑا جزیرہ کونسا ہے؟ طالب علم: جو رشتہ داروں کے بغیر ہو!",
        "بیوی: مجھے ہیرا چاہیے! شوہر: اچھا، پنسل والا یا انگوٹھی والا؟"
    ]



    let randomJoke = Math.random() * randomJokes.length;
    let roundJoke = Math.floor(Math.random() * randomJokes.length);
    let jokeGenerate = randomJokes[roundJoke];

    console.log(jokeGenerate)
    let joke = document.querySelector('#joke');
    joke.innerText = jokeGenerate;
}

// randomJokeGenerator()